{
  "backend/main.mo": "Defines an actor with one immutable and one mutable variable.",
  "feature_evidence.json": "Empty feature evidence report structure.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for all frontend source files and assets.",
  "frontend/.github/workflows/production-publish-checks.yml": "GitHub Actions workflow that validates the production slug and required files during pushes and PRs.",
  "frontend/DEPLOYMENT.md": "Deployment guide detailing slug validation, CI requirements, and pre-deployment steps.",
  "frontend/domain-slug.json": "Stores the production deployment slug and metadata.",
  "frontend/index.css": "Global Tailwind CSS base layer with OKLCH color variables and dark-mode theming.",
  "frontend/index.html": "HTML entry point loading the React app with metadata and favicon.",
  "frontend/scripts/validate-production-slug.mjs": "Node script that checks domain-slug.json for the required production slug value.",
  "frontend/src/App.tsx": "Main React app composing Hero, Gallery, About, Features, Contact, Header, and Footer.",
  "frontend/src/components/About.tsx": "About section with company overview text and two gallery images.",
  "frontend/src/components/BagGallery.tsx": "Displays handbag gallery and materials section with images and descriptions.",
  "frontend/src/components/Contact.tsx": "Contact section with company details and embedded inquiry form.",
  "frontend/src/components/ContactForm.tsx": "Implements a validated contact form with state handling, simulated submission, and a success message display.",
  "frontend/src/components/Features.tsx": "Renders a features section listing key company advantages using cards and icons.",
  "frontend/src/components/Footer.tsx": "Displays the site footer with brand info, navigation links, services, contact details, and social icons.",
  "frontend/src/components/Header.tsx": "Creates a responsive header with scroll-based styling, desktop and mobile navigation, and smooth section scrolling.",
  "frontend/src/components/Hero.tsx": "Provides the hero section with marketing text, CTA buttons, and an image with decorative elements.",
  "frontend/src/components/SectionLayout.tsx": "Wraps content in a standardized section layout with padding and container styling.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages a backend actor based on Internet Identity authentication and invalidates dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements authentication context and provider for Internet Identity, handling login, identity loading, and state management.",
  "frontend/src/index.css": "Defines Tailwind layers and global CSS variables for light/dark themes, applying Times New Roman italic styling site‑wide.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and loads global styles.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, color tokens from CSS variables, custom animations, and typography/plugins.",
  "project_state.json": "Stores project metadata, feature definitions, deployment notes, and styling/content requirements for the website."
}