{
  "backend/main.mo": "Simple Motoko actor defining one immutable and one mutable variable.",
  "feature_evidence.json": "Feature evidence report listing required UI updates and associated files for multiple components.",
  "frontend-file-summaries.txt": "Text file containing pre-generated summaries of various frontend files and assets.",
  "frontend/.github/workflows/production-publish-checks.yml": "GitHub Actions workflow that validates the production slug and related deployment files on pushes and PRs.",
  "frontend/DEPLOYMENT.md": "Deployment guide detailing production slug rules, validation steps, and pre-deployment requirements.",
  "frontend/domain-slug.json": "Defines the canonical productionSlug value 'galfashionworld-2014' with metadata.",
  "frontend/index.css": "Tailwind base styles defining OKLCH color variables and global light/dark theme rules.",
  "frontend/index.html": "HTML entry point setting metadata, favicon, and loading the React app root.",
  "frontend/scripts/validate-production-slug.mjs": "Node script that reads domain-slug.json and verifies the productionSlug matches the expected value.",
  "frontend/src/App.tsx": "Main React component assembling the full page layout with all sections.",
  "frontend/src/components/About.tsx": "About section component rendering descriptive text about the company without images.",
  "frontend/src/components/BagGallery.tsx": "Gallery component displaying a grid of handbag material cards with images, names, and hover effects.",
  "frontend/src/components/Contact.tsx": "Section with contact info (email, phone, location) and embedded ContactForm.",
  "frontend/src/components/ContactForm.tsx": "Stateful contact form with validation, simulated async submission, and success message UI.",
  "frontend/src/components/Features.tsx": "Renders a grid of feature cards describing the company's advantages.",
  "frontend/src/components/Footer.tsx": "Footer with brand info, navigation links, services, contact details, and social icons.",
  "frontend/src/components/Header.tsx": "Sticky header with scroll-based styling, navigation links, and mobile menu toggle.",
  "frontend/src/components/Hero.tsx": "Hero section with marketing text and buttons to scroll to contact or about sections.",
  "frontend/src/components/SectionLayout.tsx": "Layout wrapper component providing consistent spacing and container styles for sections.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages an authenticated or anonymous backend actor, refetching queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, handling identity loading, login, logout, and status management using AuthClient.",
  "frontend/src/index.css": "Configures global Tailwind layers, theme variables, and enforces Times New Roman italic styling across all elements with light/dark palettes.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and the Internet Identity provider, and loads global styles.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, custom OKLCH color variables, Times New Roman typography, animations, and plugin integrations.",
  "project_state.json": "Tracks project metadata, requirements, deployment notes, and design instructions for the Gal Fashion World website."
}