{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Remove videos, enforce Times New Roman italic typography, and update materials showcase images",
  "requirements": [
    {
      "id": "REQ-26",
      "summary": "Remove all videos from the UI and replace the Hero video with a static image so no video loads or plays.",
      "acceptanceCriteria": [
        "No <video> elements render in the UI (Hero and elsewhere).",
        "The Hero media area displays a static image (using the existing hero poster/image asset) with the same responsive sizing and rounded/shadow styling.",
        "No network request is made for \"/assets/hero-handbag-model-video.mp4\" during normal page load."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Hero.tsx",
          "operation": "modify",
          "description": "Remove all video-related logic and the <video> element, and render a static <img> using the existing hero image asset while preserving the same container sizing (max heights), object-cover behavior, and rounded/shadow styling."
        },
        {
          "path": "frontend/public/assets/hero-handbag-model-video.mp4",
          "operation": "delete",
          "description": "Delete the hero MP4 asset so it cannot be requested by the frontend during normal page load."
        }
      ]
    },
    {
      "id": "REQ-27",
      "summary": "Update global typography to Times New Roman (with Times/serif fallback) and italic by default across the site.",
      "acceptanceCriteria": [
        "All major text elements (headings, paragraphs, navigation, buttons, form labels, footer) render with Times New Roman (or Times/serif fallback) and italic styling.",
        "No immutable-path files are modified to accomplish this (use existing editable global CSS / Tailwind configuration)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Set global font-family to \"Times New Roman\", Times, serif for the site (e.g., on body and inherited elements) while keeping italic styling as the default across visible text."
        },
        {
          "path": "frontend/tailwind.config.js",
          "operation": "modify",
          "description": "Update Tailwind's default font family configuration so Tailwind typography and components using the default font stack resolve to \"Times New Roman\" with Times/serif fallback."
        }
      ]
    },
    {
      "id": "REQ-28",
      "summary": "Set the Hero heading phrase \"Premium Ladies Handbag Manufacturer\" to a fixed 20px font size.",
      "acceptanceCriteria": [
        "The Hero heading text \"Premium Ladies\" and \"Handbag Manufacturer\" renders at 20px (not responsive larger sizes) on both mobile and desktop.",
        "Other Hero text (tagline, paragraph, buttons) keeps its current sizing unless explicitly required by this request."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Hero.tsx",
          "operation": "modify",
          "description": "Adjust the Hero heading styling so the combined heading text renders at a fixed 20px on all breakpoints, without changing the sizing of other Hero text elements."
        }
      ]
    },
    {
      "id": "REQ-29",
      "summary": "Replace the Jacquard material card with the uploaded white towel bag photo labeled \"Towel bag\" in BagGallery.",
      "acceptanceCriteria": [
        "The materials grid no longer shows the Jacquard card/image.",
        "A new/updated card uses the uploaded image file \"WhatsApp Image 2026-02-10 at 8.32.42 PM.jpeg\" as its src (served as a static asset from frontend/public).",
        "The visible name for that card is exactly \"Towel bag\" (English casing as shown).",
        "The image has an appropriate English alt attribute describing the bag visually."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/WhatsApp Image 2026-02-10 at 8.32.42 PM.jpeg",
          "operation": "create",
          "description": "Add the user-uploaded white towel bag image as a static public asset so it can be referenced directly via /assets/WhatsApp Image 2026-02-10 at 8.32.42 PM.jpeg."
        },
        {
          "path": "frontend/src/components/BagGallery.tsx",
          "operation": "modify",
          "description": "Update the Materials & Craftsmanship materials list to remove the Jacquard card and replace it with a card using /assets/WhatsApp Image 2026-02-10 at 8.32.42 PM.jpeg, label text exactly \"Towel bag\", and an English alt attribute that visually describes the bag."
        }
      ]
    },
    {
      "id": "REQ-30",
      "summary": "Replace the \"Beads / Embroidery\" material card with the uploaded beaded bag photo labeled \"Beaded Clutch\" in BagGallery.",
      "acceptanceCriteria": [
        "The materials grid no longer shows the \"Beads / Embroidery\" card/image.",
        "A new/updated card uses the uploaded image file \"Bg-02-8.jpg\" as its src (served as a static asset from frontend/public).",
        "The visible name for that card is exactly \"Beaded Clutch\".",
        "The image has an appropriate English alt attribute describing the clutch visually."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/Bg-02-8.jpg",
          "operation": "create",
          "description": "Add the user-uploaded beaded clutch image as a static public asset so it can be referenced directly via /assets/Bg-02-8.jpg."
        },
        {
          "path": "frontend/src/components/BagGallery.tsx",
          "operation": "modify",
          "description": "Update the Materials & Craftsmanship materials list to remove the \"Beads / Embroidery\" card and replace it with a card using /assets/Bg-02-8.jpg, label text exactly \"Beaded Clutch\", and an English alt attribute that visually describes the clutch."
        }
      ]
    }
  ]
}